// Сделайте функцию, которая параметрами принимает 2 числа. Если эти числа равны - пусть функция вернет true, а если не равны - false.

// function calc(a, b) {
//     return a == b;
//   }

//   console.log(calc(2, 4));

// Сделайте функцию, которая параметрами принимает 2 числа. Если их сумма больше 10 - пусть функция вернет true, а если нет - false.

// function calc(a, b) {
//   return a + b > 10;
// }

// console.log(calc(2, 12));

// Сделайте функцию, которая параметром принимает число и проверяет - отрицательное оно или нет. Если отрицательное - пусть функция вернет true, а если нет - false.

// function calc(a) {
//   return a < 0;
// }

// console.log(calc(-1));
