// Отработка стандартных функций JavaScript
// В следующих задачах вы должны применить комбинацию стандартных функций JavaScript, чтобы решить задачу. Все методы вам известны, если вы делали задачи предыдущих уроков и проходили тесты.

//  Дана строка. Сделайте заглавным первый символ этой строки не используя цикл. Найдите два решения. Показать решение.

// let srt = 'abcdefg';
// let srtNew = srt[0].toUpperCase() + srt.slice(1);
// console.log(srtNew);

//  Дана строка, например, '123456'. Переверните эту строку (сделайте из нее '654321') не используя цикл. Показать решение.

// let str = '123456';
// let newStr = str.split('').reverse().join('');
// console.log(newStr);

//  Проверьте, что строка начинается на http://. Показать решение.

// let str = 'http://hhhhhrer';
// if (str.slice(0, 7) == 'http://') {
//   console.log('Correct');
// }

//  Проверьте, что строка заканчивается на .html. Показать решение.

// let str = 'abcdefg.html';
// if (str.substr(-5) == '.html') {
//   console.log('Correct');
// } else {
//   console.log('Not');
// }
