// Пирамидки
//  С помощью цикла for сформируйте строку '123456789' и запишите ее в переменную str.

// let srt = '';
// for (let i = 1; i < 10; i++) {
//   srt += String(i);
// }

// console.log(srt);

//  С помощью цикла for сформируйте строку '987654321' и запишите ее в переменную str.

// let str = '';
// for (let i = 9; i > 0; i--) {
//   str += String(i);
// }

// console.log(str);

//  С помощью цикла for сформируйте строку '-1-2-3-4-5-6-7-8-9-' и запишите ее в переменную str.

// let str = '-';
// for (let i = 1; i < 10; i++) {
//   str += `${String(i)}-`;
// }
// console.log(str);

//  Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:

// x
// xx
// xxx
// xxxx
// xxxxx

// var str = '';
// for (var i = 0; i < 21; i++) {
//   str = str + 'x';
//   console.log(str);
// }
//  С помощью двух вложенных циклов нарисуйте следующую пирамидку:

// 1
// 22
// 333
// 4444
// 55555
// 666666
// 7777777
// 88888888
// 999999999

// for (let i = 1; i <= 9; i++) {
//   for (var j = 1; j <= i; j++) {
//     console.log(i);
//   }
// }

//  Нарисуйте пирамиду, как показано на рисунке, воспользовавшись циклом for:

// xx
// xxxx
// xxxxxx
// xxxxxxxx
// xxxxxxxxxx

// let str = '';
// for (let i = 0; i < 5; i++) {
//   str += 'xx';
//   console.log(str);
// }
